Just tested with TF 1.0.10 and AWS 3.63.0. The same behaviour persists. Below is the console output from the second run of `terraform apply`.

```
$ terraform apply
aws_dynamodb_table.bug_test_table: Refreshing state... [id=bug_test_table]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_dynamodb_table.bug_test_table has been changed
  ~ resource "aws_dynamodb_table" "bug_test_table" {
        id             = "bug_test_table"
        name           = "bug_test_table"
      + tags           = {}
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following
plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.bug_test_table will be updated in-place
  ~ resource "aws_dynamodb_table" "bug_test_table" {
        id               = "bug_test_table"
        name             = "bug_test_table"
      ~ stream_enabled   = false -> true
      + stream_view_type = "NEW_AND_OLD_IMAGES"
        tags             = {}
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_ssm_parameter.bug_test_parameter will be created
  + resource "aws_ssm_parameter" "bug_test_parameter" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "bug_test_parameter"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + version   = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_dynamodb_table.bug_test_table: Modifying... [id=bug_test_table]
aws_dynamodb_table.bug_test_table: Modifications complete after 3s [id=bug_test_table]
╷
│ Error: Provider produced inconsistent final plan
│ 
│ When expanding the plan for aws_ssm_parameter.bug_test_parameter to include new values learned so far during apply, provider
│ "registry.terraform.io/hashicorp/aws" produced an invalid new value for .value: inconsistent values for sensitive attribute.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
$ terraform --version
Terraform v1.0.10
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v3.63.0
$ 
```
